# ""
# # Task #1
# print(17 / 2 * 3 + 2)
# print(2 + 17 / 2 * 3)
# print(19 % 4 + 15 / 2 * 3)
# print((15 + 6) - 10 * 4)
# print(17 / 2 % 2 * 3 ** 3)
# # Task # 2
# print((17 / 2) * (3 + 2))
# print((2 + 17) / 2 * 3)
# print(19 % (4 + 15) / 2 * 3)
# print((15 * 4) - (10 + 6))
# print(17 / 2 % (2 * 3) ** 3)
# # Task # 3
# a = 11
# b = 1.50
# c = 3
# print("Сумма = ", a - (b + c))
# # Task #4
# a = 2
# b = 5
# print("Анна = ", a, "Пол = ", b)
# # Task # 5
# a = int(input("Введите длину ребра "))
# print(" Объем куба ", a ** 3)
# print("Площадь боковой поверхности = ", 4 * a ** 3)
# ""
# # Task # 6
# a = int(input("Введите количество суток :"))
# print(a, "суток = ", a * 24, "часов =", a * 24 * 60, "минут = ", a * 24 * 60 * 60, " секунд  ")
# # Task # 7
# a = 182
# print("Количество полных недель = ", a // 4)
# ""


def minimum(z,y,x) :
    m=x
    if m>y:
        m=y
    if m>z:
        m=z
        return
    m1=minimum(z,y,x)
print("m1:", end= "")
